# StructuralSectionIshapeWebthicknessLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIshapeWebthicknessLocation Property
ParameterTypeId Class See Also
---
"Web Thickness Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIshapeWebthicknessLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIshapeWebthicknessLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIshapeWebthicknessLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace